## 🔍 Terraform Plan - dev Environment

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.glue_job.aws_glue_job.this will be created
  + resource "aws_glue_job" "this" {
      + arn               = (known after apply)
      + glue_version      = (known after apply)
      + id                = (known after apply)
      + job_mode          = (known after apply)
      + max_capacity      = 2
      + name              = "dev-glue-job"
      + number_of_workers = (known after apply)
      + region            = "sa-east-1"
      + role_arn          = "arn:aws:iam::973516475030:role/glue-dev-role"
      + tags_all          = (known after apply)
      + timeout           = 30
      + worker_type       = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dev-glue-script-bucket-11022/scripts/dev_glue_script.py"
        }
    }

  # module.s3_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-glue-script-bucket-11022"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "sa-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_bucket.aws_s3_object.script will be created
  + resource "aws_s3_object" "script" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "dev-glue-script-bucket-11022"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "scripts/dev_glue_script.py"
      + kms_key_id             = (known after apply)
      + region                 = "sa-east-1"
      + server_side_encryption = (known after apply)
      + source                 = "scripts/dev_glue_script.py"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + glue_job_arn   = (known after apply)

```